const getRandomInt = () => {
	// взять из прошлой ДЗ.
};

const evens = function* (start = 0, end = start + 20) {
	// цикл от start до end порождает только четные цифры
};

const randomEvenSequence = function* () {
	// порождать нужно бесконечное количество раз, каждый next() новая последовательность

	const start = getRandomInt(мин цифра 2, максимум цифра 20);
	const end = getRandomInt(мин, макс); -> 
	в последовательности должна быть как минимум одна цифра, 
	обратите внимание на это когда будите задавать мин для end.

	в последовательности не должно быть больше 20 цифр, обратите внимание на это
	когда будите задавать макс для end.


	// породить результат evens в виде массива
};